GHB2/src/Documents/гхб_ЗакреплениеПомещенийЗаСотрудниками/гхб_ЗакреплениеПомещенийЗаСотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеПомещенийЗаСотрудниками</name>
  <registerRecords>InformationRegister.гхб_ЗакреплениеСотрудниковЗаПомещениями</registerRecords>
  <registerRecords>InformationRegister.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений</registerRecords>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_ГруппыПомещений</types>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникиКраткийСостав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗакрепления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СуществующийДоступ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботы</name>
      <type>
        <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
      </type>
    </attributes>
    <attributes>
      <name>Плавающее</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботыСтарый</name>
      <type>
        <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлавающееСтарое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_ГруппыПомещений</types>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_СобытияОбъектовБД/гхб_СобытияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СобытияОбъектовБД</name>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гхб_ПользователиБазХолдинга</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность</types>
      <types>DocumentRef.гхб_СвойстваПомещений</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПомещение</types>
      <types>DocumentRef.гхб_ЗакреплениеПомещенийЗаСотрудниками</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.гхб_ГруппыПомещений</types>
      <types>DocumentRef.гхб_РаспределениеДоступовВПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеСтатусаКонсервацииПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаЛокацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.гхб_ТипыСобытийОбъектовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаГруппойПомещений/гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ЗакреплениеСотрудниковЗаГруппойПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
    </type>
  </attributes>
  <attributes>
    <name>Плавающее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГруппаПомещений</name>
    <type>
      <types>CatalogRef.гхб_ГруппыПомещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаПомещениями/гхб_ЗакреплениеСотрудниковЗаПомещениями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ЗакреплениеСотрудниковЗаПомещениями</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
    </type>
  </attributes>
  <attributes>
    <name>Плавающее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_ЗакреплениеПомещенийЗаСотрудниками/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
	
	_Администратор = Документы.гхб_ЗакреплениеПомещенийЗаСотрудниками.ТекущийПользовательИмеетПолныеПраваДляЗакрепленияПомещенияЗаСотрудниками();
	_МассивЛокаций = Документы.гхб_ЗакреплениеПомещенийЗаСотрудниками.ВернутьСписокДоступныхЛокацийДляТекущегоПользователя();
	
	НовыйПараметр = Новый ПараметрВыбора("ФильтрПоПомещениям", _МассивЛокаций);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.Помещение.ПараметрыВыбора = НовыеПараметры;
	Элементы.СотрудникиПомещение.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	ЭтотОбъект.ТолькоПросмотр = НЕ _Администратор ИЛИ ДокументБылПроведен(Объект.Ссылка);
	
	Элементы.Помещение.Видимость = (Объект.ТипЗакрепления = 0);
	Элементы.Сотрудник.Видимость = (Объект.ТипЗакрепления = 1);
	Элементы.СотрудникиПомещение.Видимость = (Объект.ТипЗакрепления = 1);
	Элементы.СотрудникиСотрудник.Видимость = (Объект.ТипЗакрепления = 0);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументБылПроведен(_Ссылка)
	
	Возврат РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(_Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	_ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) И _ТекущиеДанные.СуществующийДоступ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиЗакрытьПриИзменении(Элемент)
	
	_ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) И _ТекущиеДанные.Закрыть И НЕ _ТекущиеДанные.СуществующийДоступ Тогда
		
		_ТекущиеДанные.Закрыть = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	
	ЗагрузитьАктуальныхСотрудников(Объект.Помещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАктуальныхСотрудников(_Помещение)
	
	Объект.Сотрудники.Очистить();
	
	_МассивСотрудников = ВернутьАктуальныхСотрудниковДляПомещения(_Помещение);
	
	Для Каждого _Структура Из _МассивСотрудников Цикл
		
		НС = Объект.Сотрудники.Добавить();
		НС.Помещение = _Помещение;
		НС.Сотрудник = _Структура.Сотрудник;
		НС.РежимРаботы = _Структура.РежимРаботы;
		НС.РежимРаботыСтарый = _Структура.РежимРаботы;
		НС.Плавающее = _Структура.Плавающее;
		НС.ПлавающееСтарое = _Структура.Плавающее;
		НС.СуществующийДоступ = Истина;
			
	КонецЦикла;
	
	Объект.Сотрудники.Сортировать("СуществующийДоступ УБЫВ, Сотрудник ВОЗР");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьАктуальныхСотрудниковДляПомещения(_Помещение)
	
	_Массив = Новый Массив();
	
	Если ТипЗнч(_Помещение) = Тип("СправочникСсылка.гхб_ГруппыПомещений") Тогда
		_Массив = РегистрыСведений.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.ВернутьАктуальныхСотрудниковДляГруппыПомещений(_Помещение);
	ИначеЕсли ТипЗнч(_Помещение) = Тип("СправочникСсылка.гхб_Помещения") Тогда
		_Массив = РегистрыСведений.гхб_ЗакреплениеСотрудниковЗаПомещениями.ВернутьАктуальныхСотрудниковДляПомещения(_Помещение);
	КонецЕсли;
	
	Возврат _Массив; 
	
КонецФункции

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	_ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) Тогда
		Элементы.СотрудникиСотрудник.ТолькоПросмотр = _ТекущиеДанные.СуществующийДоступ;
		Элементы.СотрудникиПомещение.ТолькоПросмотр = _ТекущиеДанные.СуществующийДоступ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗакрепленияПриИзменении(Элемент)
	
	Объект.Сотрудники.Очистить();
	
	Если (Объект.ТипЗакрепления = 0) Тогда
		Объект.Сотрудник = ПредопределенноеЗначение("Справочник.гхб_ФизическиеЛица.ПустаяСсылка");
	Иначе
		Объект.Помещение = Неопределено;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ЗагрузитьАктуальныеПомещения(Объект.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАктуальныеПомещения(_Сотрудник)
	
	Объект.Сотрудники.Очистить();
	
	_МассивПомещения = ВернутьАктуальныеПомещенияДляСотрудника(_Сотрудник);
	
	Для Каждого _Структура Из _МассивПомещения Цикл
		
		НС = Объект.Сотрудники.Добавить();
		НС.Помещение = ?(_Структура.Свойство("Помещение"), _Структура.Помещение, _Структура.ГруппаПомещений);
		НС.Сотрудник = _Сотрудник;
		НС.РежимРаботы = _Структура.РежимРаботы;
		НС.РежимРаботыСтарый = _Структура.РежимРаботы;
		НС.Плавающее = _Структура.Плавающее;
		НС.ПлавающееСтарое = _Структура.Плавающее;
		НС.СуществующийДоступ = Истина;
			
	КонецЦикла;
	
	Объект.Сотрудники.Сортировать("СуществующийДоступ УБЫВ, Помещение ВОЗР");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьАктуальныеПомещенияДляСотрудника(_Сотрудник)
	
	_Массив = РегистрыСведений.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.ВернутьАктуальныеГруппыПомещенийДляСотрудника(_Сотрудник);
	_МассивПомещения = РегистрыСведений.гхб_ЗакреплениеСотрудниковЗаПомещениями.ВернутьАктуальныеПомещенияДляСотрудника(_Сотрудник);
	
	Для Каждого Стр Из _МассивПомещения Цикл
		_Массив.Добавить(Стр);
	КонецЦикла;
	
	Возврат _Массив; 
	
КонецФункции

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
	
		ТД = Элементы.Сотрудники.ТекущиеДанные;
		ТД.СуществующийДоступ = Ложь;
		ТД.Закрыть = Ложь;
		
		Если НЕ ЗначениеЗаполнено(ТД.Сотрудник) Тогда
			ТД.Сотрудник = Объект.Сотрудник;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.Помещение) Тогда
			ТД.Помещение = Объект.Помещение;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры
